In [1]:
import pandas 
pandas.__version__

'1.0.5'

In [2]:
import pandas as pd
import numpy as np

# Series

 A series is a single vector of data like a numpy array with an index which labels each elements in the vector

In [3]:
counts  = pd.Series([132,456,987,357,159])
print(counts)

0    132
1    456
2    987
3    357
4    159
dtype: int64

In [5]:
counts[0] ,counts[3]

(132, 357)

In [6]:
counts.values  #gives the value present inide the data set

array([132, 456, 987, 357, 159])

In [7]:
counts.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
colors = pd.Series([357,678,223,456,311],index = ['red','blue','green','yellow','purple'])

In [9]:
print(colors)

red       357
blue      678
green     223
yellow    456
purple    311
dtype: int64

In [10]:
colors['blue']  #labels can be used to refer the values in the Series

678

In [12]:
colors[1]

678

In [18]:
colors.name = 'points'
colors.index.name = 'Paints'
colors

Paints
red       357
blue      678
green     223
yellow    456
purple    311
Name: points, dtype: int64

In [19]:
np.log(colors)  #gets the log values of the data

Paints
red       5.877736
blue      6.519147
green     5.407172
yellow    6.122493
purple    5.739793
Name: points, dtype: float64

In [20]:
colors[colors>500]

Paints
blue    678
Name: points, dtype: int64

In [26]:
colors_dict = {'red':132,'green':597,'yellow':896,'purple':147}
print(colors_dict)

{'red': 132, 'green': 597, 'yellow': 896, 'purple': 147}

In [31]:

a = pd.Series(colors_dict)
print(colors_dict)
print(a)

{'red': 132, 'green': 597, 'yellow': 896, 'purple': 147}
red       132
green     597
yellow    896
purple    147
dtype: int64

# DataFrame

A dataframe represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type
Dataframe has both row and column

In [101]:
data = {"Country":["DF","FG","IH","JK","UI"],
       "Year":[2010,2011,2005,2009,2008],
       "Points":[1.2,0.5,6.8,8.4,2.6]}

In [102]:
data
data = pd.DataFrame(data)
print(data)

  Country  Year  Points
0      DF  2010     1.2
1      FG  2011     0.5
2      IH  2005     6.8
3      JK  2009     8.4
4      UI  2008     2.6

In [103]:
data

  Country  Year  Points
0      DF  2010     1.2
1      FG  2011     0.5
2      IH  2005     6.8
3      JK  2009     8.4
4      UI  2008     2.6

In [104]:
data[0:3]

  Country  Year  Points
0      DF  2010     1.2
1      FG  2011     0.5
2      IH  2005     6.8

# Change the order of the column

In [105]:
df = pd.DataFrame(data, columns = ["Year","Country","Points"])

In [106]:
df

   Year Country  Points
0  2010      DF     1.2
1  2011      FG     0.5
2  2005      IH     6.8
3  2009      JK     8.4
4  2008      UI     2.6

An index can be passed  and passing column name not existing will result in missing data

In [107]:
df['Div'] = df.Year /  df.Points
df

   Year Country  Points          Div
0  2010      DF     1.2  1675.000000
1  2011      FG     0.5  4022.000000
2  2005      IH     6.8   294.852941
3  2009      JK     8.4   239.166667
4  2008      UI     2.6   772.307692

In [108]:
df['Multi'] = df.Year *  df.Points
df

   Year Country  Points          Div    Multi
0  2010      DF     1.2  1675.000000   2412.0
1  2011      FG     0.5  4022.000000   1005.5
2  2005      IH     6.8   294.852941  13634.0
3  2009      JK     8.4   239.166667  16875.6
4  2008      UI     2.6   772.307692   5220.8

In [109]:
df['Power'] = df.Points**2
df

   Year Country  Points          Div    Multi  Power
0  2010      DF     1.2  1675.000000   2412.0   1.44
1  2011      FG     0.5  4022.000000   1005.5   0.25
2  2005      IH     6.8   294.852941  13634.0  46.24
3  2009      JK     8.4   239.166667  16875.6  70.56
4  2008      UI     2.6   772.307692   5220.8   6.76

In [111]:
df['Serie_aligned ']= pd.Series(range(5),index = [0,1,2,3,4])
df

   Year Country  Points          Div    Multi  Power  Serie_aligned
0  2010      DF     1.2  1675.000000   2412.0   1.44               0
1  2011      FG     0.5  4022.000000   1005.5   0.25               1
2  2005      IH     6.8   294.852941  13634.0  46.24               2
3  2009      JK     8.4   239.166667  16875.6  70.56               3
4  2008      UI     2.6   772.307692   5220.8   6.76               4

In [112]:
# To change the dataset into dictionary
df.to_dict()

{'Year': {0: 2010, 1: 2011, 2: 2005, 3: 2009, 4: 2008},
 'Country': {0: 'DF', 1: 'FG', 2: 'IH', 3: 'JK', 4: 'UI'},
 'Points': {0: 1.2, 1: 0.5, 2: 6.8, 3: 8.4, 4: 2.6},
 'Div': {0: 1675.0,
  1: 4022.0,
  2: 294.8529411764706,
  3: 239.16666666666666,
  4: 772.3076923076923},
 'Multi': {0: 2412.0, 1: 1005.5, 2: 13634.0, 3: 16875.600000000002, 4: 5220.8},
 'Power': {0: 1.44,
  1: 0.25,
  2: 46.239999999999995,
  3: 70.56,
  4: 6.760000000000001},
 'Serie_aligned ': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

# Dataframe Specialized Dictionary

 From a list of dicts Any list of dictionary can be made into a DataFrame

In [113]:
data= [{'a':i,'b':5*i}for i in range(10)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 5}, {'a': 2, 'b': 10}, {'a': 3, 'b': 15}, {'a': 4, 'b': 20}, {'a': 5, 'b': 25}, {'a': 6, 'b': 30}, {'a': 7, 'b': 35}, {'a': 8, 'b': 40}, {'a': 9, 'b': 45}]

   a   b
0  0   0
1  1   5
2  2  10
3  3  15
4  4  20
5  5  25
6  6  30
7  7  35
8  8  40
9  9  45

In [115]:
a = pd.DataFrame([{"aa":1,"bb":3},{"bb":5,"cc":9}])

In [116]:
a

    aa  bb   cc
0  1.0   3  NaN
1  NaN   5  9.0

In [125]:
print(a[0:1])

    aa  bb  cc
0  1.0   3 NaN